app/controllers/diagrams_controller.rb

SELECT "diagrams".* FROM "diagrams"
---
  def index
    @diagrams = Diagram.all